# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'AdoptOpenJDK/openjdk'

# Binaries
# brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mas'
brew 'mackup'
brew 'neofetch'
brew 'pkg-config'
brew 'postgres'
brew 'trash'
brew 'tree'

# Development
# Js
brew 'node'
brew 'yarn'
# Scala
# cask 'adoptopenjdk8' # install separately as doesn't work correctly in brewfile
# cask 'adoptopenjdk11' # install separately as doesn't work correctly in brewfile
brew 'sbt'
brew 'scala'
brew 'scalacenter/bloop/bloop'
# Ruby
brew 'rbenv'
# Other
# brew 'redis'

# Apps
cask 'adobe-creative-cloud'
cask 'aerial'
cask 'alfred'
cask 'alt-tab'
cask 'amorphousdiskmark'
cask 'angry-ip-scanner'
cask 'atom'
cask 'authy'
cask 'bettertouchtool'
cask 'balenaetcher'
cask 'bitwarden'
cask 'brave-browser'
cask 'cakebrew'
cask 'calibre'
cask 'cryptomator'
cask 'cyberduck'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'electrum'
cask 'firefox'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hyper'
cask 'imageoptim'
cask 'iina'
cask 'insomnia'
cask 'intellij-idea'
cask 'iterm2'
# cask 'lulu' # install separately as may hang or needs permissions
cask 'monitorcontrol'
cask 'notion'
# cask 'paragon-ntfs'
cask 'obs'
cask 'obsidian'
cask 'omnidisksweeper'
# cask 'osxfuse' # Install separately - hangs after install
# cask 'oversight' # install separately as may hang or needs permissions
cask 'postman'
cask 'sourcetree'
cask 'slack'
cask 'sweet-home3d'
cask 'timemachineeditor'
# cask 'transmission'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoomus'

# Mac App Store
mas 'Amphetamine', id: 937984704
# mas 'Banktivity 7', id: 1394863440
mas 'Bear', id: 1091189122
# mas 'Microsoft Word', id: 462054704
# mas 'Microsoft OneNote', id: 784801555
# mas 'Microsoft Excel', id: 462058435
# mas 'Microsoft PowerPoint', id: 462062816
# mas 'Microsoft Outlook', id: 985367838
mas 'Microsoft To Do', id: 1274495053
mas 'NordVPN', id: 1116599239
# mas 'Notability', id: 736189492
# mas 'SnippetsLab', id: 1006087419
mas 'Spark', id: 1176895641
